#### Terraform Plan for `dev`
<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
random_password.db: Refreshing state... [id=none]
module.rds.module.rds.module.db_instance.data.aws_partition.current: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.rds.module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.eks.module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/duynv-demo-dev-eks/cluster]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0835b58aaa8f9b0b2]
module.rds.module.rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=duynv-demo-dev-db-20251105141539117500000001]
module.eks.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.rds.module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.rds.module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=duynv-demo-dev-eks-cluster-20251105141539120200000002]
module.eks.module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::241533152550:policy/duynv-demo-dev-eks-cluster-20251105141539121700000003]
module.eks.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=241533152550]
module.eks.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::241533152550:root]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=241533152550]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=duynv-demo-dev-eks-cluster-20251105141539120200000002-20251105141544212400000005]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=duynv-demo-dev-eks-cluster-20251105141539120200000002-20251105141544175900000004]
module.eks.module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=duynv-demo-dev-eks-cluster-20251105141539120200000002-20251105141544231500000006]
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2619555524]
module.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=46001f50-e948-49fb-9336-e6a8cd3b44f7]
module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/duynv-demo-dev-eks]
module.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::241533152550:policy/duynv-demo-dev-eks-cluster-ClusterEncryption20251105141606100800000011]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=duynv-demo-dev-eks-cluster-20251105141539120200000002-20251105141608215100000012]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0bed39267e40e3d6a]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-069b2121324343737]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0268d8384ad7667e1]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0602ab998ded79a0d]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f6d7e9a99b7c61a0]
module.rds.aws_security_group.this: Refreshing state... [id=sg-063e0a5adb9457bd6]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0567d62f33f4991f2]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04eed977a3d623db1]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-07ab2c3ba48130cea]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0cf32adaf2f26ffb7]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00d7b97d6a6051f75]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0dcbda458451870f8]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-029c8380dbade034a]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06c6d49344bf1b135]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-062d1042a9550216a]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09e58c0a1d146e077]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f6d7e9a99b7c61a01080289494]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1317460336]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2439044251]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3011189898]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2050587420]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-230978806]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1150059785]
module.eks.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2804181573]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3940121247]
module.eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-737992780]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1768245053]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1966035500]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0891a57f63052a86d]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0144ae4a398b3b179]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01731686de08af9c8]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d9797bdd02dcf28d]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08d7511aa9f1ff4a2]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f026ffb4be960afb]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09adbb78ee0b11830]
module.rds.module.rds.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=duynv-demo-dev-db-2025110514155434820000000c]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-2025110514155435910000000d]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=241533152550]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=duynv-demo-dev-eks]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0567d62f33f4991f21080289494]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-2025110514155435910000000d-20251105141600405700000010]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-2025110514155435910000000d-2025110514155968810000000f]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-2025110514155435910000000d-2025110514155777570000000e]
module.rds.module.rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-JG3E4THFJ6Q2F2SVAQVXBQYT3A]
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0400889f8dfa7ec4d,Project]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["ManagedBy"]: Refreshing state... [id=sg-0400889f8dfa7ec4d,ManagedBy]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0400889f8dfa7ec4d,Environment]
module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=duynv-demo-dev-eks:arn:aws:iam::241533152550:root]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-11-05T14:26:23Z]
module.eks.module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3210447439004506600]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0924f78c036cd64cd]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=duynv-demo-dev-eks:default-20251105142630392000000017]
module.eks.module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 1s [id=eks-pod-identity-agent]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=duynv-demo-dev-eks:vpc-cni]
module.eks.module.eks.aws_eks_addon.before_compute["eks-pod-identity-agent"]: Refreshing state... [id=duynv-demo-dev-eks:eks-pod-identity-agent]
module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=duynv-demo-dev-eks#arn:aws:iam::241533152550:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=923e879def9bf38b36fa8072440dfc9e77c41ccb]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::241533152550:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/C09C23D1B29B38DA7D78D26707847FC2]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=duynv-demo-dev-eks:kube-proxy]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=duynv-demo-dev-eks:coredns]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.rds.module.rds.module.db_instance.aws_db_instance.this[0] has changed
  ~ resource "aws_db_instance" "this" {
      + domain_dns_ips                        = []
        id                                    = "db-JG3E4THFJ6Q2F2SVAQVXBQYT3A"
        tags                                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "duynv-demo"
        }
        # (70 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-southeast-1:241533152550:nodegroup/duynv-demo-dev-eks/default-20251105142630392000000017/84cd2a34-bdf3-37f8-4172-488e69231521" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "duynv-demo-dev-eks:default-20251105142630392000000017" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          ~ "t3.small" -> "t3.medium",
        ]
      - labels                 = {} -> null
      ~ node_group_name        = "default-20251105142630392000000017" -> (known after apply)
      ~ release_version        = "1.30.14-20251103" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-default-20251105142630392000000017-84cd2a34-bdf3-37f8-4172-488e69231521"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "default"
            "Project"     = "duynv-demo"
        }
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0924f78c036cd64cd"
          ~ name    = "default-20251105142624440600000015" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ node_repair_config {
          + ami_type               = (known after apply)
          + arn                    = (known after apply)
          + capacity_type          = (known after apply)
          + cluster_name           = (known after apply)
          + disk_size              = (known after apply)
          + force_update_version   = (known after apply)
          + id                     = (known after apply)
          + instance_types         = (known after apply)
          + labels                 = (known after apply)
          + node_group_name        = (known after apply)
          + node_group_name_prefix = (known after apply)
          + node_role_arn          = (known after apply)
          + release_version        = (known after apply)
          + resources              = (known after apply)
          + status                 = (known after apply)
          + subnet_ids             = (known after apply)
          + tags                   = (known after apply)
          + tags_all               = (known after apply)
          + version                = (known after apply)
        } -> (known after apply)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

_Pusher: @duyvnguyen91_